{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unets.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "to_k",
    "proj_in",
    "to_out.0",
    "proj_out",
    "to_v"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}